{
  "_class_name": "DPMSolverMultistepScheduler",
  "_diffusers_version": "0.6.0",
  "_use_default_values": [
    "time_shift_type",
    "use_beta_sigmas",
    "final_sigmas_type",
    "use_dynamic_shifting",
    "algorithm_type",
    "euler_at_final",
    "lower_order_final",
    "rescale_betas_zero_snr",
    "solver_order",
    "variance_type",
    "thresholding",
    "dynamic_thresholding_ratio",
    "prediction_type",
    "flow_shift",
    "use_flow_sigmas",
    "use_exponential_sigmas",
    "use_lu_lambdas",
    "lambda_min_clipped",
    "sample_max_value",
    "solver_type",
    "timestep_spacing"
  ],
  "algorithm_type": "dpmsolver++",
  "beta_end": 0.012,
  "beta_schedule": "scaled_linear",
  "beta_start": 0.00085,
  "clip_sample": false,
  "dynamic_thresholding_ratio": 0.995,
  "euler_at_final": false,
  "final_sigmas_type": "zero",
  "flow_shift": 1.0,
  "lambda_min_clipped": -Infinity,
  "lower_order_final": true,
  "num_train_timesteps": 1000,
  "prediction_type": "epsilon",
  "rescale_betas_zero_snr": false,
  "sample_max_value": 1.0,
  "set_alpha_to_one": false,
  "skip_prk_steps": true,
  "solver_order": 2,
  "solver_type": "midpoint",
  "steps_offset": 1,
  "thresholding": false,
  "time_shift_type": "exponential",
  "timestep_spacing": "linspace",
  "trained_betas": null,
  "use_beta_sigmas": false,
  "use_dynamic_shifting": false,
  "use_exponential_sigmas": false,
  "use_flow_sigmas": false,
  "use_karras_sigmas": true,
  "use_lu_lambdas": false,
  "variance_type": null
}