{
  "_class_name": "KDPM2DiscreteScheduler",
  "_diffusers_version": "0.6.0",
  "_use_default_values": [
    "use_beta_sigmas",
    "timestep_spacing",
    "prediction_type",
    "use_exponential_sigmas"
  ],
  "beta_end": 0.012,
  "beta_schedule": "scaled_linear",
  "beta_start": 0.00085,
  "clip_sample": false,
  "num_train_timesteps": 1000,
  "prediction_type": "epsilon",
  "set_alpha_to_one": false,
  "skip_prk_steps": true,
  "steps_offset": 1,
  "timestep_spacing": "linspace",
  "trained_betas": null,
  "use_beta_sigmas": false,
  "use_exponential_sigmas": false,
  "use_karras_sigmas": true
}